### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

# Read School and Student Data File and store into Pandas Data Frames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])

## District Summary

* Calculate the total number of schools

* Calculate the total number of students

* Calculate the total budget

* Calculate the average math score 

* Calculate the average reading score

* Calculate the overall passing rate (overall average score), i.e. (avg. math score + avg. reading score)/2

* Calculate the percentage of students with a passing math score (70 or greater)

* Calculate the percentage of students with a passing reading score (70 or greater)

* Create a dataframe to hold the above results

* Optional: give the displayed data cleaner formatting

In [2]:
school_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [3]:
student_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [4]:
school_data.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

* No of schools

In [15]:
school_count = school_data["school_name"].count()
school_count

15

* No of students

In [6]:
no_of_students = student_data["student_name"].count()
no_of_students

39170

* Total Budget

In [18]:
total_budget = school_data["budget"].sum()
total_budget

24649428

* Average Math Score

In [8]:
math_score = student_data["math_score"].mean()
math_score

78.98537145774827

* Average Reading Score

In [9]:
reading_score = student_data["reading_score"].mean()
reading_score

81.87784018381414

* Overall Average Score

In [10]:
overall_average_score = (math_score + reading_score)/2
overall_average_score

80.43160582078121

* % Students > 70% Math Score

In [20]:
per_math_score = student_data[student_data['math_score'].gt(70)]
passing_student_count = per_math_score["math_score"].count()
final_math_per = (passing_student_count/no_of_students) * 100
final_math_per

72.39213683941792

* % Students > 70% Reading Score

In [21]:
per_reading_score = student_data[student_data['reading_score'].gt(70)]
passing_student_reading_count = per_reading_score["reading_score"].count()
final_reading_per = (passing_student_reading_count/no_of_students) * 100
final_reading_per

82.97166198621395

* Create Dataframe to hold above results.

In [22]:
 
new_data = {'No of Schools':[school_count], 'No of Students':[no_of_students], 'Total Budget':[total_budget], 'Average Math Score': [math_score], 'Average Reading Score': [reading_score], 'Overall Percentage Score': [overall_average_score], 'Math Score above 70%': [final_math_per], 'Reading Score above 70%':[final_reading_per]} 
  
# Create DataFrame 
df = pd.DataFrame(new_data) 
  
# Print the output. 
df

,No of Schools,No of Students,Total Budget,Average Math Score,Average Reading Score,Overall Percentage Score,Math Score above 70%,Reading Score above 70%
0,15,39170,24649428,78.985371,81.87784,80.431606,72.392137,82.971662

## School Summary

* Create an overview table that summarizes key metrics about each school, including:
  * School Name
  * School Type
  * Total Students
  * Total School Budget
  * Per Student Budget
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)
  
* Create a dataframe to hold the above results

In [99]:
student_data.groupby('school_name').mean()

                       Student ID  reading_score  math_score
school_name
Bailey High School        20358.5      81.033963   77.048432
Cabrera High School       16941.5      83.975780   83.061895
Figueroa High School       4391.0      81.158020   76.711767
Ford High School          36165.0      80.746258   77.102592
Griffin High School       12995.5      83.816757   83.351499
Hernandez High School      9944.0      80.934412   77.289752
Holden High School        23060.0      83.814988   83.803279
Huang High School          1458.0      81.182722   76.629414
Johnson High School       32415.0      80.966394   77.072464
Pena High School          23754.5      84.044699   83.839917
Rodriguez High School     28035.0      80.744686   76.842711
Shelton High School        6746.0      83.725724   83.359455
Thomas High School        38352.0      83.848930   83.418349
Wilson High School        14871.0      83.989488   83.274201
Wright High School        25135.5      83.955000   83.682222

In [24]:
school_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [97]:
school_name =  school_data['school_name']
school_type = school_data['type']
budget_summary = school_data['budget']
student_budget = (school_data['budget'])/(school_data['size'])
school_summary = {'School Name': school_name, 'School Type': school_type, 'Total School Budget': budget_summary, 'Per Student Budget': student_budget}
school_summary_df = pd.DataFrame(school_summary)
school_summary_df

              School Name School Type  Total School Budget  Per Student Budget
0       Huang High School    District              1910635               655.0
1    Figueroa High School    District              1884411               639.0
2     Shelton High School     Charter              1056600               600.0
3   Hernandez High School    District              3022020               652.0
4     Griffin High School     Charter               917500               625.0
5      Wilson High School     Charter              1319574               578.0
6     Cabrera High School     Charter              1081356               582.0
7      Bailey High School    District              3124928               628.0
8      Holden High School     Charter               248087               581.0
9        Pena High School     Charter               585858               609.0
10     Wright High School     Charter              1049400               583.0
11  Rodriguez High School    District              2547363               637.0
12    Johnson High School    District              3094650               650.0
13       Ford High School    District              1763916               644.0
14     Thomas High School     Charter              1043130               638.0

## Top Performing Schools (By Passing Rate)

* Sort and display the top five schools in overall passing rate

## Bottom Performing Schools (By Passing Rate)

* Sort and display the five worst-performing schools

## Math Scores by Grade

* Create a table that lists the average Reading Score for students of each grade level (9th, 10th, 11th, 12th) at each school.

  * Create a pandas series for each grade. Hint: use a conditional statement.
  
  * Group each series by school
  
  * Combine the series into a dataframe
  
  * Optional: give the displayed data cleaner formatting

## Reading Score by Grade

* Perform the same operations as above for reading scores

## Scores by School Spending

* Create a table that breaks down school performances based on average Spending Ranges (Per Student). Use 4 reasonable bins to group school spending. Include in the table each of the following:
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)

In [13]:
# Sample bins. Feel free to create your own bins.
spending_bins = [0, 585, 615, 645, 675]
group_names = ["<$585", "$585-615", "$615-645", "$645-675"]

## Scores by School Size

* Perform the same operations as above, based on school size.

In [14]:
# Sample bins. Feel free to create your own bins.
size_bins = [0, 1000, 2000, 5000]
group_names = ["Small (<1000)", "Medium (1000-2000)", "Large (2000-5000)"]

## Scores by School Type

* Perform the same operations as above, based on school type.